In [2]:
import pandas as pd

In [3]:
dict1 = {
    'Apel': [1, 2, 3, 4],
    'Jeruk': [4, 5, 6, 7],
    'Mangga': [8, 9, 10, 11],
    'Nanas': [12, 13, 14, 15]
}

dfl = pd.DataFrame(dict1)
dfl

   Apel  Jeruk  Mangga  Nanas
0     1      4       8     12
1     2      5       9     13
2     3      6      10     14
3     4      7      11     15

In [6]:
dfl.count()

Apel      4
Jeruk     4
Mangga    4
Nanas     4
dtype: int64

In [7]:
dfl.sum()

Apel      10
Jeruk     22
Mangga    38
Nanas     54
dtype: int64

In [8]:
dfl.describe()

           Apel     Jeruk     Mangga      Nanas
count  4.000000  4.000000   4.000000   4.000000
mean   2.500000  5.500000   9.500000  13.500000
std    1.290994  1.290994   1.290994   1.290994
min    1.000000  4.000000   8.000000  12.000000
25%    1.750000  4.750000   8.750000  12.750000
50%    2.500000  5.500000   9.500000  13.500000
75%    3.250000  6.250000  10.250000  14.250000
max    4.000000  7.000000  11.000000  15.000000

In [9]:
done = "Berhasil"
print(done)

Berhasil